In [1]:
import pandas as pd

df = pd.DataFrame({'Name':['Bajarang','Tanish','Shubham','Soham','Ram','Raju'],
                  'Marks':[85,90,80,89,92,82],
                  'Age':[21,22,20,22,23,24],
                'Course':['Btech','BCA','pharmacy','Btech','BSC','BCA']})
print(df)

       Name  Marks  Age    Course
0  Bajarang     85   21     Btech
1    Tanish     90   22       BCA
2   Shubham     80   20  pharmacy
3     Soham     89   22     Btech
4       Ram     92   23       BSC
5      Raju     82   24       BCA

In [4]:
print(df.shape)

(6, 4)

In [5]:
df.size

24

In [5]:
df.columns

Index(['Name', 'Marks', 'Age', 'Course'], dtype='object')

In [8]:
df.dtypes

Name      object
Marks      int64
Age        int64
Course    object
dtype: object

In [2]:
df1 =df.head()
df1

       Name  Marks  Age    Course
0  Bajarang     85   21     Btech
1    Tanish     90   22       BCA
2   Shubham     80   20  pharmacy
3     Soham     89   22     Btech
4       Ram     92   23       BSC

In [3]:
df1 =df.head(3)
df1

       Name  Marks  Age    Course
0  Bajarang     85   21     Btech
1    Tanish     90   22       BCA
2   Shubham     80   20  pharmacy

In [4]:
df1 =df.tail()
df1

      Name  Marks  Age    Course
1   Tanish     90   22       BCA
2  Shubham     80   20  pharmacy
3    Soham     89   22     Btech
4      Ram     92   23       BSC
5     Raju     82   24       BCA

In [6]:
df1 =df.tail(3)
df1

    Name  Marks  Age Course
3  Soham     89   22  Btech
4    Ram     92   23    BSC
5   Raju     82   24    BCA

In [7]:
df1 =df.sample()
df1

      Name  Marks  Age    Course
2  Shubham     80   20  pharmacy

In [8]:
df1 =df.sample(4)
df1

       Name  Marks  Age    Course
0  Bajarang     85   21     Btech
2   Shubham     80   20  pharmacy
3     Soham     89   22     Btech
1    Tanish     90   22       BCA

In [9]:
df1 =df.describe()
df1

           Marks        Age
count   6.000000   6.000000
mean   86.333333  22.000000
std     4.760952   1.414214
min    80.000000  20.000000
25%    82.750000  21.250000
50%    87.000000  22.000000
75%    89.750000  22.750000
max    92.000000  24.000000

In [10]:
df1 =df.info()
df1

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Marks   6 non-null      int64
 2   Age     6 non-null      int64
 3   Course  6 non-null      object
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [11]:
df1 =df.count()
df1

Name      6
Marks     6
Age       6
Course    6
dtype: int64

In [12]:
df1 =df.count(axis =0)
df1

Name      6
Marks     6
Age       6
Course    6
dtype: int64

In [14]:
df1 =df.count(axis =1)
print(df1)

0    4
1    4
2    4
3    4
4    4
5    4
dtype: int64

In [15]:
df1 =df.value_counts()
df1

Name      Marks  Age  Course
Bajarang  85     21   Btech       1
Raju      82     24   BCA         1
Ram       92     23   BSC         1
Shubham   80     20   pharmacy    1
Soham     89     22   Btech       1
Tanish    90     22   BCA         1
Name: count, dtype: int64

In [39]:
df['Course'].value_counts()

Course
Btech       2
BCA         2
pharmacy    1
BSC         1
Name: count, dtype: int64

In [40]:
df['Course'].unique()

array(['Btech', 'BCA', 'pharmacy', 'BSC'], dtype=object)

In [41]:
df['Course'].nunique()

4

In [16]:
import pandas as pd

df = pd.DataFrame({'Name':['Bajarang','Tanish','Shubham','Soham','Ram','Raju'],
                  'Marks':[85,90,80,89,92,82],
                  'Age':[21,22,20,22,23,24],
                'Course':['Btech','BCA','pharmacy','Btech','BSC','BCA']})
df

       Name  Marks  Age    Course
0  Bajarang     85   21     Btech
1    Tanish     90   22       BCA
2   Shubham     80   20  pharmacy
3     Soham     89   22     Btech
4       Ram     92   23       BSC
5      Raju     82   24       BCA

In [17]:
# iloc

a =df.iloc[:3,:]
a

       Name  Marks  Age    Course
0  Bajarang     85   21     Btech
1    Tanish     90   22       BCA
2   Shubham     80   20  pharmacy

In [18]:
a =df.iloc[::2,2:]
a

   Age    Course
0   21     Btech
2   20  pharmacy
4   23       BSC

In [19]:
a =df.iloc[1:,1:]
a

   Marks  Age    Course
1     90   22       BCA
2     80   20  pharmacy
3     89   22     Btech
4     92   23       BSC
5     82   24       BCA

In [24]:
a =df.iloc[:2:,:]
a

       Name  Marks  Age Course
0  Bajarang     85   21  Btech
1    Tanish     90   22    BCA

In [23]:
a =df.iloc[:2,2:]
a

   Age Course
0   21  Btech
1   22    BCA

In [27]:
# loc

a = df.loc[:4:1,:]
a

       Name  Marks  Age    Course
0  Bajarang     85   21     Btech
1    Tanish     90   22       BCA
2   Shubham     80   20  pharmacy
3     Soham     89   22     Btech
4       Ram     92   23       BSC

In [28]:
a = df.loc[::1,['Age','Course']]
a

   Age    Course
0   21     Btech
1   22       BCA
2   20  pharmacy
3   22     Btech
4   23       BSC
5   24       BCA

In [29]:
a = df.loc[2::,['Name','Marks','Course']]
a

      Name  Marks    Course
2  Shubham     80  pharmacy
3    Soham     89     Btech
4      Ram     92       BSC
5     Raju     82       BCA

In [30]:
a = df.loc[:,['Name','Marks']]
a

       Name  Marks
0  Bajarang     85
1    Tanish     90
2   Shubham     80
3     Soham     89
4       Ram     92
5      Raju     82

In [31]:
p = df['Course']
p

0       Btech
1         BCA
2    pharmacy
3       Btech
4         BSC
5         BCA
Name: Course, dtype: object

In [32]:
p =df[['Name','Age','Course']]
p

       Name  Age    Course
0  Bajarang   21     Btech
1    Tanish   22       BCA
2   Shubham   20  pharmacy
3     Soham   22     Btech
4       Ram   23       BSC
5      Raju   24       BCA

In [33]:
import pandas as pd

data = ({'Name':['Bajarang','Tanish','Shubham','Soham','Ram','Raju'],
                  'Marks':[85,90,80,89,92,82],
                  'Age':[21,22,20,22,23,24],
                'Course':['Btech','BCA','pharmacy','Btech','BSC','BCA']})
df =pd.DataFrame(data)
df

       Name  Marks  Age    Course
0  Bajarang     85   21     Btech
1    Tanish     90   22       BCA
2   Shubham     80   20  pharmacy
3     Soham     89   22     Btech
4       Ram     92   23       BSC
5      Raju     82   24       BCA

In [34]:
df.columns =['Full_name','Score','my_age','My_course']
df.head()

  Full_name  Score  my_age My_course
0  Bajarang     85      21     Btech
1    Tanish     90      22       BCA
2   Shubham     80      20  pharmacy
3     Soham     89      22     Btech
4       Ram     92      23       BSC

In [35]:
df.rename(columns= {'Name':'Full_name','Marks':'score'},inplace=True)
df.head()

  Full_name  score  Age    Course
0  Bajarang     85   21     Btech
1    Tanish     90   22       BCA
2   Shubham     80   20  pharmacy
3     Soham     89   22     Btech
4       Ram     92   23       BSC